In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
df.sex.value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [3]:
df.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [4]:
nunique = pd.DataFrame(df.nunique())
nunique.style.background_gradient(cmap="turbo")

In [5]:
df[["pclass","parch"]].nunique()

pclass    3
parch     7
dtype: int64

In [6]:
df["embarked"].dtypes

dtype('O')

In [7]:
df["embarked"] = df["embarked"].astype("category")
df["embarked"].dtypes

CategoricalDtype(categories=['C', 'Q', 'S'], ordered=False)

In [8]:
df["class"].dtype

CategoricalDtype(categories=['First', 'Second', 'Third'], ordered=False)

In [9]:
df.loc[df["embarked"] =="C"]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
866,1,2,female,27.0,1,0,13.8583,C,Second,woman,False,NaN,Cherbourg,yes,False
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [11]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [14]:
df.loc[df["embarked"].isnull()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [16]:
df.loc[df["embarked"] ==np.nan]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []

In [10]:
(df["embarked"] =="C").sum()

168

In [11]:
df.loc[~(df["embarked"] =="S")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [12]:
df.loc[(df["age"]<30) & (df["sex"]=="female")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True

In [13]:
df["embark_town"]

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [19]:
df.loc[(df["age"]<30) & (df["sex"]=="female") & (df["embark_town"].str.contains("Queenstown",na=False))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
44,1,3,female,19.0,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
156,1,3,female,16.0,0,0,7.7333,Q,Third,woman,False,NaN,Queenstown,yes,True
208,1,3,female,16.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
289,1,3,female,22.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
654,0,3,female,18.0,0,0,6.7500,Q,Third,woman,False,NaN,Queenstown,no,True

In [14]:
df.loc[(df["age"]<30) & (df["sex"]=="female") & (df["embark_town"].isin(["Queenstown"]))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
44,1,3,female,19.0,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
156,1,3,female,16.0,0,0,7.7333,Q,Third,woman,False,NaN,Queenstown,yes,True
208,1,3,female,16.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
289,1,3,female,22.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
654,0,3,female,18.0,0,0,6.7500,Q,Third,woman,False,NaN,Queenstown,no,True

In [20]:
df.loc[(df["embark_town"].isin(["Queenstown"]))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
32,1,3,female,NaN,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
790,0,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
825,0,3,male,NaN,0,0,6.9500,Q,Third,man,True,NaN,Queenstown,no,True
828,1,3,male,NaN,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,yes,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [15]:
df[(df["fare"]>500) & (df["age"]>20)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True

In [16]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [17]:
df["deck"].fillna(df["deck"].mode().loc[0],inplace=True)

In [18]:
df["age"].fillna(df["age"].median(),inplace=True)

In [19]:
df.groupby(["sex","pclass"]).agg({"survived":["mean","count"]})

               survived
                   mean count
sex    pclass
female 1       0.968085    94
       2       0.921053    76
       3       0.500000   144
male   1       0.368852   122
       2       0.157407   108
       3       0.135447   347

In [23]:
X=df.drop("survived",axis=1)
y = df["survived"]

In [24]:
y.groupby(X["sex"]).mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [22]:
df.drop("who",axis=1,inplace=True)

In [27]:
df["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [28]:
df["age_flag"] =df["age"].apply(lambda x: 1 if x<30 else 0)

In [29]:
def alt(x):
    if x <30:
        return 1
    else:
        return 0
    
df["age"].apply(alt)

0      1
1      0
2      1
3      0
4      0
      ..
886    1
887    1
888    1
889    1
890    0
Name: age, Length: 891, dtype: int64

In [30]:
df2 = sns.load_dataset("tips")
df2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [31]:
df2.groupby("time").agg({"total_bill":["min","mean","max"]})

       total_bill
              min       mean    max
time
Lunch        7.51  17.168676  43.11
Dinner       3.07  20.797159  50.81

In [32]:
df2.pivot_table(index="day",values="total_bill",aggfunc=["min","mean","max"])

            min       mean        max
     total_bill total_bill total_bill
day
Thur       7.51  17.682742      43.11
Fri        5.75  17.151579      40.17
Sat        3.07  20.441379      50.81
Sun        7.25  21.410000      48.17

In [35]:
df2.groupby(["time","sex","day"]).agg({"total_bill":["min","max","mean"]}).loc[:,"Female",:]

            total_bill
                   min    max       mean
time   day
Lunch  Thur       8.35  43.11  16.648710
       Fri       10.09  16.27  13.940000
       Sat         NaN    NaN        NaN
       Sun         NaN    NaN        NaN
Dinner Thur      18.78  18.78  18.780000
       Fri        5.75  22.75  14.310000
       Sat        3.07  44.30  19.680357
       Sun        9.60  35.26  19.872222

In [36]:
df2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [55]:
df2.loc[(df2["size"]<3) & (df2["total_bill"] > 10)]

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
3         23.68  3.31    Male     No   Sun  Dinner     2
8         15.04  1.96    Male     No   Sun  Dinner     2
9         14.78  3.23    Male     No   Sun  Dinner     2
10        10.27  1.71    Male     No   Sun  Dinner     2
..          ...   ...     ...    ...   ...     ...   ...
237       32.83  1.17    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[143 rows x 7 columns]

In [58]:
df2.loc[(df2["size"]<3) & (df2["total_bill"] > 10),"total_bill"].mean()

17.184965034965035

In [59]:
df2["total_bill_tip_sum"] = df2["total_bill"] + df2["tip"]

In [68]:
df2.sort_values(by="total_bill_tip_sum",ascending=True).iloc[:30]

     total_bill   tip     sex smoker   day    time  size  total_bill_tip_sum
67         3.07  1.00  Female    Yes   Sat  Dinner     1                4.07
92         5.75  1.00  Female    Yes   Fri  Dinner     2                6.75
111        7.25  1.00  Female     No   Sat  Dinner     1                8.25
195        7.56  1.44    Male     No  Thur   Lunch     2                9.00
218        7.74  1.44    Male    Yes   Sat  Dinner     2                9.18
149        7.51  2.00    Male     No  Thur   Lunch     2                9.51
135        8.51  1.25  Female     No  Thur   Lunch     2                9.76
145        8.35  1.50  Female     No  Thur   Lunch     2                9.85
126        8.52  1.48    Male     No  Thur   Lunch     2               10.00
222        8.58  1.92    Male    Yes   Fri   Lunch     1               10.50
6          8.77  2.00    Male     No   Sun  Dinner     2               10.77
30         9.55  1.45    Male     No   Sat  Dinner     2               11.00
43         9.68  1.32    Male     No   Sun  Dinner     2               11.00
235       10.07  1.25    Male     No   Sat  Dinner     2               11.32
53         9.94  1.56    Male     No   Sun  Dinner     2               11.50
148        9.78  1.73    Male     No  Thur   Lunch     2               11.51
75        10.51  1.25    Male     No   Sat  Dinner     2               11.76
82        10.07  1.83  Female     No  Thur   Lunch     1               11.90
10        10.27  1.71    Male     No   Sun  Dinner     2               11.98
1         10.34  1.66    Male     No   Sun  Dinner     3               12.00
16        10.33  1.67  Female     No   Sun  Dinner     3               12.00
226       10.09  2.00  Female    Yes   Fri   Lunch     2               12.09
117       10.65  1.50  Female     No  Thur   Lunch     2               12.15
168       10.59  1.61  Female    Yes   Sat  Dinner     2               12.20
233       10.77  1.47    Male     No   Sat  Dinner     2               12.24
136       10.33  2.00  Female     No  Thur   Lunch     2               12.33
196       10.34  2.00    Male    Yes  Thur   Lunch     2               12.34
172        7.25  5.15    Male    Yes   Sun  Dinner     2               12.40
169       10.63  2.00  Female    Yes   Sat  Dinner     2               12.63
132       11.17  1.50  Female     No  Thur   Lunch     2               12.67

In [67]:
df2.nsmallest(30,"total_bill_tip_sum")

     total_bill   tip     sex smoker   day    time  size  total_bill_tip_sum
67         3.07  1.00  Female    Yes   Sat  Dinner     1                4.07
92         5.75  1.00  Female    Yes   Fri  Dinner     2                6.75
111        7.25  1.00  Female     No   Sat  Dinner     1                8.25
195        7.56  1.44    Male     No  Thur   Lunch     2                9.00
218        7.74  1.44    Male    Yes   Sat  Dinner     2                9.18
149        7.51  2.00    Male     No  Thur   Lunch     2                9.51
135        8.51  1.25  Female     No  Thur   Lunch     2                9.76
145        8.35  1.50  Female     No  Thur   Lunch     2                9.85
126        8.52  1.48    Male     No  Thur   Lunch     2               10.00
222        8.58  1.92    Male    Yes   Fri   Lunch     1               10.50
6          8.77  2.00    Male     No   Sun  Dinner     2               10.77
30         9.55  1.45    Male     No   Sat  Dinner     2               11.00
43         9.68  1.32    Male     No   Sun  Dinner     2               11.00
235       10.07  1.25    Male     No   Sat  Dinner     2               11.32
53         9.94  1.56    Male     No   Sun  Dinner     2               11.50
148        9.78  1.73    Male     No  Thur   Lunch     2               11.51
75        10.51  1.25    Male     No   Sat  Dinner     2               11.76
82        10.07  1.83  Female     No  Thur   Lunch     1               11.90
10        10.27  1.71    Male     No   Sun  Dinner     2               11.98
1         10.34  1.66    Male     No   Sun  Dinner     3               12.00
16        10.33  1.67  Female     No   Sun  Dinner     3               12.00
226       10.09  2.00  Female    Yes   Fri   Lunch     2               12.09
117       10.65  1.50  Female     No  Thur   Lunch     2               12.15
168       10.59  1.61  Female    Yes   Sat  Dinner     2               12.20
233       10.77  1.47    Male     No   Sat  Dinner     2               12.24
136       10.33  2.00  Female     No  Thur   Lunch     2               12.33
196       10.34  2.00    Male    Yes  Thur   Lunch     2               12.34
172        7.25  5.15    Male    Yes   Sun  Dinner     2               12.40
169       10.63  2.00  Female    Yes   Sat  Dinner     2               12.63
132       11.17  1.50  Female     No  Thur   Lunch     2               12.67